___

<a href='http://www.pieriandata.com'><img src='../Pierian_Data_Logo.png'/></a>
___
<center><em>Copyright by Pierian Data Inc.</em></center>
<center><em>For more information, visit us at <a href='http://www.pieriandata.com'>www.pieriandata.com</a></em></center>

# Pandas Project Exercise 

# The Data

This data set contains booking information for a city hotel and a resort hotel, and includes information such as when the booking was made, length of stay, the number of adults, children, and/or babies, and the number of available parking spaces, among other things.

All personally identifying information has been removed from the data.

Acknowledgements
The data is originally from the article Hotel Booking Demand Datasets, written by Nuno Antonio, Ana Almeida, and Luis Nunes for Data in Brief, Volume 22, February 2019.


----------------------------

#### NOTE: Names, Emails, Phone Numbers, and Credit Card numbers in the data are synthetic and not real information from people. The hotel data is real from the publication listed above.

## <div style="text-align: center">Data Column Reference</div>

<table><thead><tr class="rowsep-1"><th scope="col"><strong>Variable</strong></th><th scope="col"><strong>Type</strong></th><th scope="col"><strong>Description</strong></th><th scope="col"><strong>Source/Engineering</strong></th></tr></thead><tbody><tr><th scope="row"><em>ADR</em></th><td>Numeric</td><td>Average Daily Rate as defined by <a name="bbib5" href="#bib5" class="workspace-trigger">[5]</a></td><td>BO, BL and TR / Calculated by dividing the sum of all lodging transactions by the total number of staying nights</td></tr><tr><th scope="row"><em>Adults</em></th><td>Integer</td><td>Number of adults</td><td>BO and BL</td></tr><tr><th scope="row"><em>Agent</em></th><td>Categorical</td><td>ID of the travel agency that made the booking<a name="btbl1fna" href="#tbl1fna" class="workspace-trigger"><sup>a</sup></a></td><td>BO and BL</td></tr><tr><th scope="row"><em>ArrivalDateDayOfMonth</em></th><td>Integer</td><td>Day of the month of the arrival date</td><td>BO and BL</td></tr><tr><th scope="row"><em>ArrivalDateMonth</em></th><td>Categorical</td><td>Month of arrival date with 12 categories: “January” to “December”</td><td>BO and BL</td></tr><tr><th scope="row"><em>ArrivalDateWeekNumber</em></th><td>Integer</td><td>Week number of the arrival date</td><td>BO and BL</td></tr><tr><th scope="row"><em>ArrivalDateYear</em></th><td>Integer</td><td>Year of arrival date</td><td>BO and BL</td></tr><tr><th scope="row"><em>AssignedRoomType</em></th><td>Categorical</td><td>Code for the type of room assigned to the booking. Sometimes the assigned room type differs from the reserved room type due to hotel operation reasons (e.g. overbooking) or by customer request. Code is presented instead of designation for anonymity reasons</td><td>BO and BL</td></tr><tr><th scope="row"><em>Babies</em></th><td>Integer</td><td>Number of babies</td><td>BO and BL</td></tr><tr><th scope="row"><em>BookingChanges</em></th><td>Integer</td><td>Number of changes/amendments made to the booking from the moment the booking was entered on the PMS until the moment of check-in or cancellation</td><td>BO and BL/Calculated by adding the number of unique iterations that change some of the booking attributes, namely: persons, arrival date, nights, reserved room type or meal</td></tr><tr><th scope="row"><em>Children</em></th><td>Integer</td><td>Number of children</td><td>BO and BL/Sum of both payable and non-payable children</td></tr><tr><th scope="row"><em>Company</em></th><td>Categorical</td><td>ID of the company/entity that made the booking or responsible for paying the booking. ID is presented instead of designation for anonymity reasons</td><td>BO and BL.</td></tr><tr><th scope="row"><em>Country</em></th><td>Categorical</td><td>Country of origin. Categories are represented in the ISO 3155–3:2013 format <a name="bbib6" href="#bib6" class="workspace-trigger">[6]</a></td><td>BO, BL and NT</td></tr><tr><th scope="row"><br></th><td><br></td><td><br></td><td><br></td></tr><tr><th scope="row" rowspan="5"><em>CustomerType</em></th><td rowspan="5">Categorical</td><td>Type of booking, assuming one of four categories:</td><td rowspan="5">BO and BL</td></tr><tr><td>Contract - when the booking has an allotment or other type of contract associated to it;</td></tr><tr><td>Group – when the booking is associated to a group;</td></tr><tr><td>Transient – when the booking is not part of a group or contract, and is not associated to other transient booking;</td></tr><tr><td>Transient-party – when the booking is transient, but is associated to at least other transient booking</td></tr><tr><th scope="row"><em>DaysInWaitingList</em></th><td>Integer</td><td>Number of days the booking was in the waiting list before it was confirmed to the customer</td><td>BO/Calculated by subtracting the date the booking was confirmed to the customer from the date the booking entered on the PMS</td></tr><tr><th scope="row"><br></th><td><br></td><td><br></td><td><br></td></tr><tr><th scope="row" rowspan="7"><em>DepositType</em></th><td rowspan="7">Categorical</td><td>Indication on if the customer made a deposit to guarantee the booking. This variable can assume three categories:</td><td rowspan="2">BO and TR/Value calculated based on the payments identified for the booking in the transaction (TR) table before the booking׳s arrival or cancellation date.</td></tr><tr><td rowspan="3">No Deposit – no deposit was made;</td></tr><tr><td>In case no payments were found the value is “No Deposit”.</td></tr><tr><td rowspan="2">If the payment was equal or exceeded the total cost of stay, the value is set as “Non Refund”.</td></tr><tr><td rowspan="2">Non Refund – a deposit was made in the value of the total stay cost;</td></tr><tr><td rowspan="2">Otherwise the value is set as “Refundable”</td></tr><tr><td>Refundable – a deposit was made with a value under the total cost of stay.</td></tr><tr><th scope="row"><em>DistributionChannel</em></th><td>Categorical</td><td>Booking distribution channel. The term “TA” means “Travel Agents” and “TO” means “Tour Operators”</td><td>BO, BL and DC</td></tr><tr><th scope="row"><em>IsCanceled</em></th><td>Categorical</td><td>Value indicating if the booking was canceled (1) or not (0)</td><td>BO</td></tr><tr><th scope="row"><em>IsRepeatedGuest</em></th><td>Categorical</td><td>Value indicating if the booking name was from a repeated guest (1) or not (0)</td><td>BO, BL and C/ Variable created by verifying if a profile was associated with the booking customer. If so, and if the customer profile creation date was prior to the creation date for the booking on the PMS database it was assumed the booking was from a repeated guest</td></tr><tr><th scope="row"><em>LeadTime</em></th><td>Integer</td><td>Number of days that elapsed between the entering date of the booking into the PMS and the arrival date</td><td>BO and BL/ Subtraction of the entering date from the arrival date</td></tr><tr><th scope="row"><em>MarketSegment</em></th><td>Categorical</td><td>Market segment designation. In categories, the term “TA” means “Travel Agents” and “TO” means “Tour Operators”</td><td>BO, BL and MS</td></tr><tr><th scope="row"><br></th><td><br></td><td><br></td><td><br></td></tr><tr><th scope="row" rowspan="5"><em>Meal</em></th><td rowspan="5">Categorical</td><td>Type of meal booked. Categories are presented in standard hospitality meal packages:</td><td rowspan="5">BO, BL and ML</td></tr><tr><td>Undefined/SC – no meal package;</td></tr><tr><td>BB – Bed &amp; Breakfast;</td></tr><tr><td>HB – Half board (breakfast and one other meal – usually dinner);</td></tr><tr><td>FB – Full board (breakfast, lunch and dinner)</td></tr><tr><th scope="row"><em>PreviousBookingsNotCanceled</em></th><td>Integer</td><td>Number of previous bookings not cancelled by the customer prior to the current booking</td><td>BO and BL / In case there was no customer profile associated with the booking, the value is set to 0. Otherwise, the value is the number of bookings with the same customer profile created before the current booking and not canceled.</td></tr><tr><th scope="row"><em>PreviousCancellations</em></th><td>Integer</td><td>Number of previous bookings that were cancelled by the customer prior to the current booking</td><td>BO and BL/ In case there was no customer profile associated with the booking, the value is set to 0. Otherwise, the value is the number of bookings with the same customer profile created before the current booking and canceled.</td></tr><tr><th scope="row"><em>RequiredCardParkingSpaces</em></th><td>Integer</td><td>Number of car parking spaces required by the customer</td><td>BO and BL</td></tr><tr><th scope="row"><br></th><td><br></td><td><br></td><td><br></td></tr><tr><th scope="row" rowspan="4"><em>ReservationStatus</em></th><td rowspan="4">Categorical</td><td>Reservation last status, assuming one of three categories:</td><td rowspan="4">BO</td></tr><tr><td>Canceled – booking was canceled by the customer;</td></tr><tr><td>Check-Out – customer has checked in but already departed;</td></tr><tr><td>No-Show – customer did not check-in and did inform the hotel of the reason why</td></tr><tr><th scope="row"><em>ReservationStatusDate</em></th><td>Date</td><td>Date at which the last status was set. This variable can be used in conjunction with the <em>ReservationStatus</em> to understand when was the booking canceled or when did the customer checked-out of the hotel</td><td>BO</td></tr><tr><th scope="row"><em>ReservedRoomType</em></th><td>Categorical</td><td>Code of room type reserved. Code is presented instead of designation for anonymity reasons</td><td>BO and BL</td></tr><tr><th scope="row"><em>StaysInWeekendNights</em></th><td>Integer</td><td>Number of weekend nights (Saturday or Sunday) the guest stayed or booked to stay at the hotel</td><td>BO and BL/ Calculated by counting the number of weekend nights from the total number of nights</td></tr><tr><th scope="row"><em>StaysInWeekNights</em></th><td>Integer</td><td>Number of week nights (Monday to Friday) the guest stayed or booked to stay at the hotel</td><td>BO and BL/Calculated by counting the number of week nights from the total number of nights</td></tr><tr><th scope="row"><em>TotalOfSpecialRequests</em></th><td>Integer</td><td>Number of special requests made by the customer (e.g. twin bed or high floor)</td><td>BO and BL/Sum of all special requests</td></tr></tbody></table>

-----------

# TASKS

**Complete the tasks shown in bold below. The expected output is shown in a cell below. Be careful not to run the cell above the expected output, as it will clear the expected output. Try your best to solve these in one line of pandas code (not every single question can be solved in one line, but many can be!) Refer to solutions notebook and video to view possible solutions. NOTE: Many tasks have multiple correct solution methods!**

-----
### TASK: Run the following code to read in the "hotel_booking_data.csv" file. Feel free to explore the file a bit before continuing with the rest of the exercise.

In [37]:
import pandas as pd

In [319]:
hotels = pd.read_csv("hotel_booking_data.csv")

In [320]:
hotels.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,name,email,phone-number,credit_card
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Ernest Barnes,Ernest.Barnes31@outlook.com,669-792-1661,************4322
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Andrea Baker,Andrea_Baker94@aol.com,858-637-6955,************9157
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Rebecca Parker,Rebecca_Parker@comcast.net,652-885-2745,************3734
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Laura Murray,Laura_M@gmail.com,364-656-8427,************5677
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,Transient,98.0,0,1,Check-Out,2015-07-03,Linda Hines,LHines@verizon.com,713-226-5883,************5498

---
**TASK: How many rows are there?**

In [40]:
len(hotels)

119390

**TASK: Is there any missing data? If so, which column has the most missing data?**

In [41]:
hotels.isnull().sum()

hotel                                  0
is_canceled                            0
lead_time                              0
arrival_date_year                      0
arrival_date_month                     0
arrival_date_week_number               0
arrival_date_day_of_month              0
stays_in_weekend_nights                0
stays_in_week_nights                   0
adults                                 0
children                               4
babies                                 0
meal                                   0
country                              488
market_segment                         0
distribution_channel                   0
is_repeated_guest                      0
previous_cancellations                 0
previous_bookings_not_canceled         0
reserved_room_type                     0
assigned_room_type                     0
booking_changes                        0
deposit_type                           0
agent                              16340
company                           112593
days_in_waiting_list                   0
customer_type                          0
adr                                    0
required_car_parking_spaces            0
total_of_special_requests              0
reservation_status                     0
reservation_status_date                0
name                                   0
email                                  0
phone-number                           0
credit_card                            0
dtype: int64

**TASK: Drop the "company" column from the dataset.**

In [46]:
#There isn't even a 'company' column in the dataset to begin with:
hotels.columns

Index(['hotel', 'is_canceled', 'lead_time', 'arrival_date_year',
       'arrival_date_month', 'arrival_date_week_number',
       'arrival_date_day_of_month', 'stays_in_weekend_nights',
       'stays_in_week_nights', 'adults', 'children', 'babies', 'meal',
       'country', 'market_segment', 'distribution_channel',
       'is_repeated_guest', 'previous_cancellations',
       'previous_bookings_not_canceled', 'reserved_room_type',
       'assigned_room_type', 'booking_changes', 'deposit_type', 'agent',
       'company', 'days_in_waiting_list', 'customer_type', 'adr',
       'required_car_parking_spaces', 'total_of_special_requests',
       'reservation_status', 'reservation_status_date', 'name', 'email',
       'phone-number', 'credit_card'],
      dtype='object')

**TASK: What are the top 5 most common country codes in the dataset?**

In [207]:
hotels['country'].value_counts().head(5)

PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
Name: country, dtype: int64

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> Another way to do a top <i>n</i> list is:
    
     hotels['country'].value_counts().head()[:n]
    
   So, if you wanted to do a top 10, set n to 10, or if you want the last 10, [n:], etc. This gives a lot more flexability than relying on .head(n)
   
</div>

PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
Name: country, dtype: int64

**TASK: What is the name of the person who paid the highest ADR (average daily rate)? How much was their ADR?**

In [83]:
#hotels.sort_values(by = 'adr', ascending = False)['adr']
hotels.iloc[48515]['adr']

5400.0

In [429]:
hotels.iloc[48515][['adr', 'name']]

adr            5400.0
name    Daniel Walter
Name: 48515, dtype: object

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> The way my instructor did this is similar to what I did, but instead of running 
       
    hotels.sort_values(by = 'adr', ascending = False)['adr']
And then manually taking the numerical index for that max and inputing it into hotels.iloc, he did this:
    
    hotels.sort_values(by = 'adr', ascending = False)[['adr','name']].iloc[0]
Which gives the same result
</div>

adr              5400
name    Daniel Walter
Name: 48515, dtype: object

**TASK: The adr is the average daily rate for a person's stay at the hotel. What is the mean adr across all the hotel stays in the dataset?**

In [87]:
hotels['adr'].mean()

101.83112153446453

101.83

**TASK: What is the average (mean) number of nights for a stay across the entire data set? Feel free to round this to 2 decimal points.**

In [439]:
total_nights = hotels['stays_in_week_nights'] + hotels['stays_in_weekend_nights'].astype('int')
total_nights.mean()

3.4279001591423066

3.43

**TASK: What is the average total cost for a stay in the dataset? Not *average daily cost*, but *total* stay cost. (You will need to calculate total cost your self by using ADR and week day and weeknight stays). Feel free to round this to 2 decimal points.**

In [444]:
hotels.head()
hotels['total_nights'] = hotels['stays_in_week_nights'] + hotels['stays_in_weekend_nights'].astype('int')
total_cost = hotels['total_nights'] * hotels['adr']
round(total_cost.mean(), 2)

357.85

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> I had an issue with this at first because I forgot to set total_nights to be a column within hotels
</div>

357.85

**TASK: What are the names and emails of people who made exactly 5 "Special Requests"?**

In [117]:
hotels[hotels['total_of_special_requests'] == 5][['name', 'email']].head()

                 name                      email
7860    Amanda Harper       Amanda.H66@yahoo.com
11125   Laura Sanders  Sanders_Laura@hotmail.com
14596     Tommy Ortiz        Tommy_O@hotmail.com
14921  Gilbert Miller     Miller.Gilbert@aol.com
14922  Timothy Torres     TTorres@protonmail.com

                          name                          email
7860             Amanda Harper           Amanda.H66@yahoo.com
11125            Laura Sanders      Sanders_Laura@hotmail.com
14596              Tommy Ortiz            Tommy_O@hotmail.com
14921           Gilbert Miller         Miller.Gilbert@aol.com
14922           Timothy Torres         TTorres@protonmail.com
24630          Jennifer Weaver             Jennifer_W@aol.com
27288           Crystal Horton             Crystal.H@mail.com
27477           Brittney Burke       Burke_Brittney16@att.com
29906          Cynthia Cabrera    Cabrera.Cynthia@xfinity.com
29949              Sarah Floyd              Sarah_F@gmail.com
32267           Michelle Villa         Michelle.Villa@aol.com
39027           Nichole Hebert       Hebert.Nichole@gmail.com
39129         Lindsey Mckenzie       Lindsey.Mckenzie@att.com
39525           Ashley Edwards       Edwards.Ashley@yahoo.com
70114       Christopher Torres   Torres.Christopher@gmail.com
78819   Mrs. Tara Sullivan DVM           Mrs..DVM@xfinity.com
78820           Michaela Brown          MichaelaBrown@att.com
78822        Kurt Maldonado MD              KMD15@xfinity.com
97072         Jason Richardson               Jason.R@zoho.com
97099             Terri Hurley            THurley@xfinity.com
97261        Mrs. Caitlin Webb             Mrs._W@comcast.net
98410             Holly Arroyo          Arroyo_Holly@mail.com
98674          Denise Campbell             Denise_C@gmail.com
99887            Michael Smith            Michael.S42@aol.com
99888       Dr. Trevor Sellers                  Dr._S@aol.com
101569            Kayla Murphy         Kayla.Murphy@yahoo.com
102061         Taylor Martinez    Taylor.Martinez@hotmail.com
109511          Charles Wilson       Charles_Wilson@yahoo.com
109590           Tyler Allison         Tyler.A@protonmail.com
110082          Matthew Bailey         Matthew_Bailey@aol.com
110083       Charlotte Acevedo        Charlotte_A@verizon.com
111909         Darrell Brennan  Brennan_Darrell51@hotmail.com
111911          Melinda Jensen         MelindaJensen@zoho.com
113915            Terry Arnold          Arnold.Terry@zoho.com
114770             Mary Nguyen     Nguyen.Mary@protonmail.com
114909          Lindsay Cuevas      Lindsay.Cuevas40@mail.com
116455       Cynthia Hernandez   CynthiaHernandez@xfinity.com
116457          Angela Hawkins             Angela_H@gmail.com
118817              Sue Lawson            Sue.L52@comcast.net
119161         Alyssa Richards        Alyssa_Richards@aol.com

**TASK: What percentage of hotel stays were classified as "repeat guests"? (Do not base this off the name of the person, but instead of the is_repeated_guest column)**

In [139]:
yes_repeat = len(hotels[hotels['is_repeated_guest'] == 1]['is_repeated_guest'])
no_repeat = len(hotels[hotels['is_repeated_guest'] == 0]['is_repeated_guest'])
percent_repeat = (yes_repeat/(yes_repeat + no_repeat)*100)
percent_repeat

3.191222045397437

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> My instructor did this by doing:
    
    100 * sum(hotels['is_repeated_guest] ==1) / len(hotels)
Which makes sense since my approach of creating two seperate variables and then summing them gets 100% in the denominator anyway. There is no need to create new variables in this example.
</div>

3.19

**TASK: What are the top 5 most common last name in the dataset? Bonus: Can you figure this out in one line of pandas code? (For simplicity treat the a title such as MD as a last name, for example Caroline Conley MD can be said to have the last name MD)**

In [152]:
hotels[['first_name', 'last_name']] = hotels['name'].str.split(' ', n = 1, expand = True)

In [158]:
hotels['last_name'].value_counts()

Smith               2466
Johnson             1968
Williams            1590
Jones               1420
Brown               1403
                    ...
Ashley Stein DVM       1
Jasmine Barnett        1
Ross Eaton             1
Paul Harris            1
Conley MD              1
Name: last_name, Length: 4784, dtype: int64

I'm going to redo this to see if I can get it in 1 line:

In [465]:
hotels['name'].str.split(' ', expand = True)[1].value_counts()[:5]

Smith       2510
Johnson     1998
Williams    1628
Jones       1441
Brown       1433
Name: 1, dtype: int64

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> As it turns out, there was no need to create an entirely new column for the first and last name. You can do str.split() without actually saving the pieces as new columns.
    
This is not how my instructor did it though. This is what he did:
</div>

In [469]:
hotels['name'].apply(lambda name: name.split()[-1]).value_counts()[:5]

Smith       2503
Johnson     1990
Williams    1618
Jones       1434
Brown       1423
Name: name, dtype: int64

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> My instructor said the other option is to use a custom function:
    
    def grab_lastname(name):
    return name.split()[-1]
    
    hotels['name'].apply(grab_lastname).valuecounts()
    
But honestly, I don't think either function is really needed in this particular case. Maybe doing a lambda would be more RAM efficent since it's running in C.
</div>

**TASK: What are the names of the people who had booked the most number children and babies for their stay? (Don't worry if they canceled, only consider number of people reported at the time of their reservation)**

In [181]:
hotels['total_kids'] = hotels['children'] + hotels['babies']
hotels[['name', 'adults', 'total_kids', 'children', 'babies']].sort_values(by = 'total_kids', ascending = False).head(3)

                  name  adults  total_kids  children  babies
328      Jamie Ramirez       2        10.0      10.0       0
46619  Nicholas Parker       2        10.0       0.0      10
78656    Marc Robinson       1         9.0       0.0       9

                  name  adults  total_kids  babies  children
328      Jamie Ramirez       2        10.0       0      10.0
46619  Nicholas Parker       2        10.0      10       0.0
78656    Marc Robinson       1         9.0       9       0.0

**TASK: What are the top 3 most common area code in the phone numbers? (Area code is first 3 digits)**

In [205]:
hotels[['area_codes', 'remainder_number']] = hotels['phone-number'].str.split('-', n = 1, expand = True)
hotels = hotels.drop(columns = 'remainder_number')
hotels['area_codes'].value_counts().head(3)

799    168
185    167
541    166
Name: area_codes, dtype: int64

In [475]:
hotels['phone-number'].str.split('-', n = 1, expand = True)[0].value_counts()[:3]

799    168
185    167
541    166
Name: 0, dtype: int64

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> Similar to before, I tried to do this a second time in one line, which is shown directly above. Again, I don't see the benefit of creating either a lambda or custom function to do this, using a method call seems to be perfectly readable and efficent. Note: The number in the left column is the index value, not the count. Just for posterity, here's how to do it as a lambda:
</div>

In [477]:
hotels['phone-number'].apply(lambda num: num[:3]).value_counts()[:3]

799    168
185    167
541    166
Name: phone-number, dtype: int64

Code - Total Count

799    168
185    167
541    166
Name: phone-number, dtype: int64

**TASK: How many arrivals took place between the 1st and the 15th of the month (inclusive of 1 and 15) ? Bonus: Can you do this in one line of pandas code?**

In [236]:
len(hotels[hotels['arrival_date_day_of_month'] < 16][hotels['arrival_date_day_of_month'] > 0])
#This approach seems to have barely worked. I am interested in seeing how the instructor did it, since I don't think this would've worked if I needed to do an OR operator

C:\Users\User\AppData\Local\Temp\ipykernel_1360\1755036351.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  len(hotels[hotels['arrival_date_day_of_month'] < 16][hotels['arrival_date_day_of_month'] > 0])

58152

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> This is how my instructor did it:
</div>

In [479]:
hotels['arrival_date_day_of_month'].apply(lambda day: day in range(1, 16)).sum()

58152

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> This is a much cleaner approach, and it gives more flexibility if I had needed to do an OR operator
</div>

58152


**HARD BONUS TASK: Create a table for counts for each day of the week that people arrived. (E.g. 5000 arrivals were on a Monday, 3000 were on a Tuesday, etc..)**

In [321]:
hotels.head()
#For this task, I think I'll try to create a new column showing the date, which I'll do by combining the month, day of month, year, etc. and then I'll let Pandas figure out which day of the week this corresponds to. This seems vastly simpler than trying to create some sort of custom dictionary matching the day of the week to the day of the month.

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,name,email,phone-number,credit_card
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Ernest Barnes,Ernest.Barnes31@outlook.com,669-792-1661,************4322
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Andrea Baker,Andrea_Baker94@aol.com,858-637-6955,************9157
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Rebecca Parker,Rebecca_Parker@comcast.net,652-885-2745,************3734
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Laura Murray,Laura_M@gmail.com,364-656-8427,************5677
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,Transient,98.0,0,1,Check-Out,2015-07-03,Linda Hines,LHines@verizon.com,713-226-5883,************5498

In [322]:
hotels['date_series'] = hotels['arrival_date_month'] + ' ' + hotels['arrival_date_day_of_month'].astype('str') + ', ' + hotels['arrival_date_year'].astype('str')

from datetime import datetime
hotels['checkin_date'] = pd.to_datetime(hotels['date_series'])
hotels['checkin_date'].dt.weekday.max()

6

So far, I've managed to convert the seperate columns representing the year, month and day of the month into one new datetime column named checkin_date
I might've been able to do this without creating a new column date_series, but this approach works so it's not a huge deal

Using dt.weekday, I can see that datetime has automatically assigned the weekday based on the calender date, which was my goal with this approach in the first place. 0 is monday and 6 is sunday.

In [327]:
hotels['day_of_week'] = hotels['checkin_date'].dt.day_name()
hotels['day_of_week'].unique()

array(['Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday', 'Monday',
       'Tuesday'], dtype=object)

I've created a new column, day_of_week which shows the day of the week for each arrival, and dropped the date_series column

In [360]:
hotels.groupby('day_of_week').count()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,total_of_special_requests,reservation_status,reservation_status_date,name,email,phone-number,credit_card,date_series,checkin_date,day_count
day_of_week,,,,,,,,,,,,,,,,,,,,,
Friday,19631,19631,19631,19631,19631,19631,19631,19631,19631,19631,...,19631,19631,19631,19631,19631,19631,19631,19631,19631,0
Monday,18171,18171,18171,18171,18171,18171,18171,18171,18171,18171,...,18171,18171,18171,18171,18171,18171,18171,18171,18171,0
Saturday,18055,18055,18055,18055,18055,18055,18055,18055,18055,18055,...,18055,18055,18055,18055,18055,18055,18055,18055,18055,0
Sunday,14141,14141,14141,14141,14141,14141,14141,14141,14141,14141,...,14141,14141,14141,14141,14141,14141,14141,14141,14141,0
Thursday,19254,19254,19254,19254,19254,19254,19254,19254,19254,19254,...,19254,19254,19254,19254,19254,19254,19254,19254,19254,0
Tuesday,13999,13999,13999,13999,13999,13999,13999,13999,13999,13999,...,13999,13999,13999,13999,13999,13999,13999,13999,13999,0
Wednesday,16139,16139,16139,16139,16139,16139,16139,16139,16139,16139,...,16139,16139,16139,16139,16139,16139,16139,16139,16139,0

In [361]:
hotels.groupby('day_of_week').count()['is_canceled']

day_of_week
Friday       19631
Monday       18171
Saturday     18055
Sunday       14141
Thursday     19254
Tuesday      13999
Wednesday    16139
Name: is_canceled, dtype: int64

In [362]:
hotels['day_count'] = hotels.groupby('day_of_week').count()['is_canceled']

In order to create the column day_count, which is the total count for each day, I took one of the columns, is_canceled and used its count. The main problem with this approach that I see is that if this were an extremely long column, i.e. more than just 7 rows, and there were null values somewhere in this columm, this might result in a lower count than I was expecting. That doesn't seem to be the case here, but if I wanted to avoid this, I could fill in the nulls higher up using .dropna(). Also, I already found the columns with nulls previously in this project by doing .isnull.sum()

Again though, that doesn't seem to really matter in this particular case, and just using the count for is_canceled to find a count for day_count seems to have worked fine

In [363]:
hotels['day_count']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
119385   NaN
119386   NaN
119387   NaN
119388   NaN
119389   NaN
Name: day_count, Length: 119390, dtype: float64

In [357]:
hotels[['day_of_week', 'day_count']]

       day_of_week  day_count
0        Wednesday        NaN
1        Wednesday        NaN
2        Wednesday        NaN
3        Wednesday        NaN
4        Wednesday        NaN
...            ...        ...
119385   Wednesday        NaN
119386    Thursday        NaN
119387    Thursday        NaN
119388    Thursday        NaN
119389     Tuesday        NaN

[119390 rows x 2 columns]

This isn't working out as I was expecting. Even though passing

hotels.groupby('day_of_week').count()['is_canceled']

gives the the counts I am looking for, I can't assign this to a new column, since that new column just fills in with null values, presumably because it's trying to read the day as an int or something, or the data isn't lining up right

In [370]:
hotels.groupby('day_of_week').count()['is_canceled']

day_of_week
Friday       19631
Monday       18171
Saturday     18055
Sunday       14141
Thursday     19254
Tuesday      13999
Wednesday    16139
Name: is_canceled, dtype: int64

I'm going to do what I should've done earlier, which is assign the groupby to be a new datafame

In [390]:
day_counts = hotels.groupby('day_of_week').count()['is_canceled']
day_counts

day_of_week
Friday       19631
Monday       18171
Saturday     18055
Sunday       14141
Thursday     19254
Tuesday      13999
Wednesday    16139
Name: is_canceled, dtype: int64

At this point, I've basically done what was asked, but it isn't in the form of a dataframe and it isn't labled correctly: it's still using the is_canceled column

I'm going to try again from the start and see if I can do this in a cleaner way:

-------------

I still think that creating a seperate column for date_series2 is a good approach since it would be extremely messy to try to concatenate within the pd.to_datetime conversion, and I don't know if that would even work in the first place. Creating a seperate variable certainly helped me in terms of reading my own code, and I can always drop the column later.

Also, I'm not totally sure if including commas and spaces in the date_series2 string is necessary, I just did so to avoid any potential errors

In [428]:
#from datetime import datetime
#Creating a new column date_series2 in order to concatenate a string which datetime can interpret:
hotels['date_series2'] = hotels['arrival_date_month'] + ' ' + hotels['arrival_date_day_of_month'].astype('str') + ', ' + hotels['arrival_date_year'].astype('str')
#Converting into datetime:
hotels['checkin_date2'] = pd.to_datetime(hotels['date_series2'])
#Creating a new column which shows the day of the week based on datetime:
hotels['day_of_week2'] = hotels['checkin_date2'].dt.day_name()
#Removing the columns I created from my previous attempt for clarity:
hotels2 = hotels.drop(columns = ['day_of_week','day_count', 'date_series'])
hotels2['day_of_week2'].value_counts()

Friday       19631
Thursday     19254
Monday       18171
Saturday     18055
Wednesday    16139
Sunday       14141
Tuesday      13999
Name: day_of_week2, dtype: int64

Does this do what was asked? I think so. I'll check with the course to see.

Answer: Yes, this is what was asked.

Note: This approach doesn't have the potential problem with null values that I might've had if I was trying to use the count value of a single column 

______________

Just for clarification sake, this still doesn't work as I would have expected:

I have to ask Patrick about this so he can explain what I need to do to actually get this to work:

In [426]:
hotels2['counts2'] = hotels2['day_of_week2'].value_counts()
hotels2['counts2']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
119385   NaN
119386   NaN
119387   NaN
119388   NaN
119389   NaN
Name: counts2, Length: 119390, dtype: float64

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> This is how my instructor did it:
</div>

In [480]:
#import numpy as np
def convert(day, month, year):
    return f"{day}-{month}-{year}"

In [483]:
hotels['date3'] = np.vectorize(convert)(hotels['arrival_date_day_of_month'],
                                       hotels['arrival_date_month'],
                                       hotels['arrival_date_year'])

In [485]:
hotels['date3'] = pd.to_datetime(hotels['date3'])

In [490]:
hotels['date3'].dt.day_name()

0         Wednesday
1         Wednesday
2         Wednesday
3         Wednesday
4         Wednesday
            ...
119385    Wednesday
119386     Thursday
119387     Thursday
119388     Thursday
119389      Tuesday
Name: date3, Length: 119390, dtype: object

In [491]:
hotels['date3'].dt.day_name().value_counts()

Friday       19631
Thursday     19254
Monday       18171
Saturday     18055
Wednesday    16139
Sunday       14141
Tuesday      13999
Name: date3, dtype: int64

<div class="alert alert-block alert-info">
    <b>DG's Review Note:</b> This is overall similar to my approach, but he used np.vectorize and a custom function to concatenate the three date columns into one. My approach worked, but I can see how the function approach would be much more reliable with larger datasets.
</div>